MitchBradley/FluidTerm2/src/stm32loader/stm32action.cpp
#include <sys/types.h>
#include <sys/stat.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>
#include <string.h>
#include <signal.h>

#include "init.h"
#include "utils.h"
#include "serial.h"
#include "stm32.h"
#include "parsers/parser.h"
#include "port.h"

#include "parsers/binary.h"
#include "parsers/hex.h"

#if defined(__WIN32__) || defined(__CYGWIN__)
#    include <windows.h>
#endif

/* device globals */
stm32_t*               stm    = NULL;
void*                  p_st   = NULL;
parser_t*              parser = NULL;
struct port_interface* port   = NULL;

/* settings */
struct port_options port_opts = {
    .device = "auto",
    //    .baudRate     = SERIAL_BAUD_115200,
    .baudRate     = 115200,
    .serial_mode  = "8n1",
    .bus_addr     = 0,
    .rx_frame_max = STM32_MAX_RX_FRAME,
    .tx_frame_max = STM32_MAX_TX_FRAME,
};

enum actions { ACT_NONE, ACT_READ, ACT_WRITE, ACT_WRITE_UNPROTECT, ACT_READ_PROTECT, ACT_READ_UNPROTECT, ACT_ERASE_ONLY, ACT_CRC };

enum actions action       = ACT_NONE;
int          npages       = 0;
int          spage        = 0;
int          no_erase     = 0;
char         verify       = 0;
int          retry        = 10;
char         exec_flag    = 0;
uint32_t     execute      = 0;
char         init_flag    = 1;
int          use_stdinout = 0;
char         force_binary = 0;
FILE*        diag;
char         reset_flag = 0;
char*        filename;
char*        gpio_seq      = NULL;
uint32_t     start_addr    = 0;
uint32_t     readwrite_len = 0;

static void init_options() {
    npages       = 0;
    spage        = 0;
    no_erase     = 0;
    verify       = 0;
    retry        = 10;
    exec_flag    = 0;
    execute      = 0;
    init_flag    = 1;
    use_stdinout = 0;
    force_binary = 0;
    diag;
    reset_flag    = 0;
    gpio_seq      = NULL;
    start_addr    = 0;
    readwrite_len = 0;
}

/* functions */

static const char* action2str(enum actions act) {
    switch (act) {
        case ACT_READ:
            return "memory read";
        case ACT_WRITE:
            return "memory write";
        case ACT_WRITE_UNPROTECT:
            return "write unprotect";
        case ACT_READ_PROTECT:
            return "read protect";
        case ACT_READ_UNPROTECT:
            return "read unprotect";
        case ACT_ERASE_ONLY:
            return "flash erase";
        case ACT_CRC:
            return "memory crc";
        default:
            return "";
    };
}

static void err_multi_action(enum actions newaction) {
    fprintf(stderr,
            "ERROR: Invalid options !\n"
            "\tCan't execute \"%s\" and \"%s\" at the same time.\n",
            action2str(action),
            action2str(newaction));
}

static int is_addr_in_ram(uint32_t addr) {
    return addr >= stm->dev->ram_start && addr < stm->dev->ram_end;
}

static int is_addr_in_flash(uint32_t addr) {
    return addr >= stm->dev->fl_start && addr < stm->dev->fl_end;
}

static int is_addr_in_opt_bytes(uint32_t addr) {
    /* option bytes upper range is inclusive in our device table */
    return addr >= stm->dev->opt_start && addr <= stm->dev->opt_end;
}

static int is_addr_in_sysmem(uint32_t addr) {
    return addr >= stm->dev->mem_start && addr < stm->dev->mem_end;
}

/* returns the page that contains address "addr" */
static int flash_addr_to_page_floor(uint32_t addr) {
    int       page;
    uint32_t* psize;

    if (!is_addr_in_flash(addr))
        return 0;

    page = 0;
    addr -= stm->dev->fl_start;
    psize = stm->dev->fl_ps;

    while (addr >= psize[0]) {
        addr -= psize[0];
        page++;
        if (psize[1])
            psize++;
    }

    return page;
}

/* returns the first page whose start addr is >= "addr" */
int flash_addr_to_page_ceil(uint32_t addr) {
    int       page;
    uint32_t* psize;

    if (!(addr >= stm->dev->fl_start && addr <= stm->dev->fl_end))
        return 0;

    page = 0;
    addr -= stm->dev->fl_start;
    psize = stm->dev->fl_ps;

    while (addr >= psize[0]) {
        addr -= psize[0];
        page++;
        if (psize[1])
            psize++;
    }

    return addr ? page + 1 : page;
}

/* returns the lower address of flash page "page" */
static uint32_t flash_page_to_addr(int page) {
    int      i;
    uint32_t addr, *psize;

    addr  = stm->dev->fl_start;
    psize = stm->dev->fl_ps;

    for (i = 0; i < page; i++) {
        addr += psize[0];
        if (psize[1])
            psize++;
    }

    return addr;
}

int parse_options(int argc, char* argv[]);

int stm32main(int argc, char* argv[]) {
    int          ret = 1;
    stm32_err_t  s_err;
    parser_err_t perr;

    uint8_t      buffer[256];
    uint32_t     addr, start, end;
    unsigned int len;
    int          failed = 0;
    int          first_page, num_pages;

    diag = stdout;

    if (parse_options(argc, argv) != 0)
        goto close;

    if (action == ACT_READ && use_stdinout) {
        diag = stderr;
    }

    if (action == ACT_WRITE) {
        /* first try hex */
        if (!force_binary) {
            parser = &PARSER_HEX;
            p_st   = parser->init();
            if (!p_st) {
                fprintf(stderr, "%s Parser failed to initialize\n", parser->name);
                goto close;
            }
        }

        if (force_binary || (perr = parser->open(p_st, filename, 0)) != PARSER_ERR_OK) {
            if (force_binary || perr == PARSER_ERR_INVALID_FILE) {
                if (!force_binary) {
                    parser->close(p_st);
                    p_st = NULL;
                }

                /* now try binary */
                parser = &PARSER_BINARY;
                p_st   = parser->init();
                if (!p_st) {
                    fprintf(stderr, "%s Parser failed to initialize\n", parser->name);
                    goto close;
                }
                perr = parser->open(p_st, filename, 0);
            }

            /* if still have an error, fail */
            if (perr != PARSER_ERR_OK) {
                fprintf(stderr, "%s ERROR: %s\n", parser->name, parser_errstr(perr));
                if (perr == PARSER_ERR_SYSTEM)
                    perror(filename);
                goto close;
            }
        }

        fprintf(diag, "Using Parser : %s\n", parser->name);
    } else {
        parser = &PARSER_BINARY;
        p_st   = parser->init();
        if (!p_st) {
            fprintf(stderr, "%s Parser failed to initialize\n", parser->name);
            goto close;
        }
    }

