MitchBradley/FluidTerm2/src/stm32loader/stm32action.cpp
    if (port_open(&port_opts, &port) != PORT_ERR_OK) {
        fprintf(stderr, "Failed to open port: %s\n", port_opts.device);
        goto close;
    }

    //    fprintf(diag, "Interface %s: %s\n", port->name, port->get_cfg_str(port));
    if (init_flag && init_bl_entry(port, gpio_seq)) {
        ret = 1;
        fprintf(stderr, "Failed to send boot enter sequence\n");
        goto close;
    }

    port->flush(port);

    stm = stm32_init(port, init_flag);
    if (!stm)
        goto close;

    fprintf(diag, "Version      : 0x%02x\n", stm->bl_version);
    if (port->flags & PORT_GVR_ETX) {
        fprintf(diag, "Option 1     : 0x%02x\n", stm->option1);
        fprintf(diag, "Option 2     : 0x%02x\n", stm->option2);
    }
    fprintf(diag, "Device ID    : 0x%04x (%s)\n", stm->pid, stm->dev->name);
    fprintf(diag,
            "- RAM        : Up to %dKiB  (%db reserved by bootloader)\n",
            (stm->dev->ram_end - 0x20000000) / 1024,
            stm->dev->ram_start - 0x20000000);
    fprintf(diag,
            "- Flash      : Up to %dKiB (size first sector: %dx%d)\n",
            (stm->dev->fl_end - stm->dev->fl_start) / 1024,
            stm->dev->fl_pps,
            stm->dev->fl_ps[0]);
    fprintf(diag, "- Option RAM : %db\n", stm->dev->opt_end - stm->dev->opt_start + 1);
    fprintf(diag, "- System RAM : %dKiB\n", (stm->dev->mem_end - stm->dev->mem_start) / 1024);

    /*
	 * Cleanup addresses:
	 *
	 * Starting from options
	 *	start_addr, readwrite_len, spage, npages
	 * and using device memory size, compute
	 *	start, end, first_page, num_pages
	 */
    if (start_addr || readwrite_len) {
        start = start_addr;

        if (is_addr_in_flash(start))
            end = stm->dev->fl_end;
        else {
            no_erase = 1;
            if (is_addr_in_ram(start))
                end = stm->dev->ram_end;
            else if (is_addr_in_opt_bytes(start))
                end = stm->dev->opt_end + 1;
            else if (is_addr_in_sysmem(start))
                end = stm->dev->mem_end;
            else {
                /* Unknown territory */
                if (readwrite_len)
                    end = start + readwrite_len;
                else
                    end = start + sizeof(uint32_t);
            }
        }

        if (readwrite_len && (end > start + readwrite_len))
            end = start + readwrite_len;

        first_page = flash_addr_to_page_floor(start);
        if (!first_page && end == stm->dev->fl_end)
            num_pages = STM32_MASS_ERASE;
        else
            num_pages = flash_addr_to_page_ceil(end) - first_page;
    } else if (!spage && !npages) {
        start      = stm->dev->fl_start;
        end        = stm->dev->fl_end;
        first_page = 0;
        num_pages  = STM32_MASS_ERASE;
    } else {
        first_page = spage;
        start      = flash_page_to_addr(first_page);
        if (start > stm->dev->fl_end) {
            fprintf(stderr, "Address range exceeds flash size.\n");
            goto close;
        }

        if (npages) {
            num_pages = npages;
            end       = flash_page_to_addr(first_page + num_pages);
            if (end > stm->dev->fl_end)
                end = stm->dev->fl_end;
        } else {
            end       = stm->dev->fl_end;
            num_pages = flash_addr_to_page_ceil(end) - first_page;
        }

        if (!first_page && end == stm->dev->fl_end)
            num_pages = STM32_MASS_ERASE;
    }

    if (action == ACT_READ) {
        unsigned int max_len = port_opts.rx_frame_max;

        perr = parser->open(p_st, filename, 1);
        if (perr != PARSER_ERR_OK) {
            fprintf(stderr, "%s ERROR: %s\n", parser->name, parser_errstr(perr));
            if (perr == PARSER_ERR_SYSTEM)
                perror(filename);
            goto close;
        }

        fflush(diag);
        addr = start;
        while (addr < end) {
            uint32_t left = end - addr;
            len           = max_len > left ? left : max_len;
            s_err         = stm32_read_memory(stm, addr, buffer, len);
            if (s_err != STM32_ERR_OK) {
                fprintf(stderr, "Failed to read memory at address 0x%08x, target write-protected?\n", addr);
                goto close;
            }
            if (parser->write(p_st, buffer, len) != PARSER_ERR_OK) {
                fprintf(stderr, "Failed to write data to file\n");
                goto close;
            }
            addr += len;

            fprintf(diag, "\rRead address 0x%08x (%.2f%%) ", addr, (100.0f / (float)(end - start)) * (float)(addr - start));
            fflush(diag);
        }
        fprintf(diag, "Done.\n");
        ret = 0;
        goto close;
    } else if (action == ACT_READ_PROTECT) {
        fprintf(diag, "Read-Protecting flash\n");
        /* the device automatically performs a reset after the sending the ACK */
        reset_flag = 0;
        s_err      = stm32_readprot_memory(stm);
        if (s_err != STM32_ERR_OK) {
            fprintf(stderr, "Failed to read-protect flash\n");
            goto close;
        }
        fprintf(diag, "Done.\n");
        ret = 0;
    } else if (action == ACT_READ_UNPROTECT) {
        fprintf(diag, "Read-UnProtecting flash\n");
        /* the device automatically performs a reset after the sending the ACK */
        reset_flag = 0;
        s_err      = stm32_runprot_memory(stm);
        if (s_err != STM32_ERR_OK) {
            fprintf(stderr, "Failed to read-unprotect flash\n");
            goto close;
        }
        fprintf(diag, "Done.\n");
        ret = 0;
    } else if (action == ACT_ERASE_ONLY) {
        ret = 0;
        fprintf(diag, "Erasing flash\n");

        if (num_pages != STM32_MASS_ERASE && (start != flash_page_to_addr(first_page) || end != flash_page_to_addr(first_page + num_pages))) {
            fprintf(stderr, "Specified start & length are invalid (must be page aligned)\n");
            ret = 1;
            goto close;
        }

        s_err = stm32_erase_memory(stm, first_page, num_pages);
        if (s_err != STM32_ERR_OK) {
            fprintf(stderr, "Failed to erase memory\n");
            ret = 1;
            goto close;
        }
        ret = 0;
    } else if (action == ACT_WRITE_UNPROTECT) {
        fprintf(diag, "Write-unprotecting flash\n");
        /* the device automatically performs a reset after the sending the ACK */
        reset_flag = 0;
        s_err      = stm32_wunprot_memory(stm);
        if (s_err != STM32_ERR_OK) {
            fprintf(stderr, "Failed to write-unprotect flash\n");
            goto close;
        }
        fprintf(diag, "Done.\n");
        ret = 0;
    } else if (action == ACT_WRITE) {
        fprintf(diag, "Write to memory\n");

