MitchBradley/FluidTerm2/src/stm32loader/stm32action.cpp
        unsigned int offset = 0;
        unsigned int r;
        unsigned int size;
        unsigned int max_wlen, max_rlen;

        max_wlen = port_opts.tx_frame_max - 2; /* skip len and crc */
        max_wlen &= ~3;                        /* 32 bit aligned */

        max_rlen = port_opts.rx_frame_max;
        max_rlen = max_rlen < max_wlen ? max_rlen : max_wlen;

        /* Assume data from stdin is whole device */
        if (use_stdinout)
            size = end - start;
        else
            size = parser->size(p_st);

        // TODO: It is possible to write to non-page boundaries, by reading out flash
        //       from partial pages and combining with the input data
        // if ((start % stm->dev->fl_ps[i]) != 0 || (end % stm->dev->fl_ps[i]) != 0) {
        //	fprintf(stderr, "Specified start & length are invalid (must be page aligned)\n");
        //	goto close;
        // }

        // TODO: If writes are not page aligned, we should probably read out existing flash
        //       contents first, so it can be preserved and combined with new data
        if (!no_erase && num_pages) {
            fprintf(diag, "Erasing memory\n");
            s_err = stm32_erase_memory(stm, first_page, num_pages);
            if (s_err != STM32_ERR_OK) {
                fprintf(stderr, "Failed to erase memory\n");
                goto close;
            }
        }

        fflush(diag);
        addr = start;
        while (addr < end && offset < size) {
            uint32_t left = end - addr;
            len           = max_wlen > left ? left : max_wlen;
            len           = len > size - offset ? size - offset : len;

            if (parser->read(p_st, buffer, &len) != PARSER_ERR_OK)
                goto close;

            if (len == 0) {
                if (use_stdinout) {
                    break;
                } else {
                    fprintf(stderr, "Failed to read input file\n");
                    goto close;
                }
            }

        again:
            s_err = stm32_write_memory(stm, addr, buffer, len);
            if (s_err != STM32_ERR_OK) {
                fprintf(stderr, "Failed to write memory at address 0x%08x\n", addr);
                goto close;
            }

            if (verify) {
                uint8_t      compare[len];
                unsigned int offset, rlen;

                offset = 0;
                while (offset < len) {
                    rlen  = len - offset;
                    rlen  = rlen < max_rlen ? rlen : max_rlen;
                    s_err = stm32_read_memory(stm, addr + offset, compare + offset, rlen);
                    if (s_err != STM32_ERR_OK) {
                        fprintf(stderr, "Failed to read memory at address 0x%08x\n", addr + offset);
                        goto close;
                    }
                    offset += rlen;
                }

                for (r = 0; r < len; ++r)
                    if (buffer[r] != compare[r]) {
                        if (failed == retry) {
                            fprintf(stderr,
                                    "Failed to verify at address 0x%08x, expected 0x%02x and found 0x%02x\n",
                                    (uint32_t)(addr + r),
                                    buffer[r],
                                    compare[r]);
                            goto close;
                        }
                        ++failed;
                        goto again;
                    }

                failed = 0;
            }

            addr += len;
            offset += len;

            fprintf(diag, "\rWrote %saddress 0x%08x (%.2f%%) ", verify ? "and verified " : "", addr, (100.0f / size) * offset);
            fflush(diag);
        }

        fprintf(diag, "Done.\n");
        ret = 0;
        goto close;
    } else if (action == ACT_CRC) {
        uint32_t crc_val = 0;

        fprintf(diag, "CRC computation\n");

        s_err = stm32_crc_wrapper(stm, start, end - start, &crc_val);
        if (s_err != STM32_ERR_OK) {
            fprintf(stderr, "Failed to read CRC\n");
            goto close;
        }
        fprintf(diag, "CRC(0x%08x-0x%08x) = 0x%08x\n", start, end, crc_val);
        ret = 0;
        goto close;
    } else
        ret = 0;

close:
    if (stm && exec_flag && ret == 0) {
        if (execute == 0)
            execute = stm->dev->fl_start;

        fprintf(diag, "\nStarting execution at address 0x%08x... ", execute);
        fflush(diag);
        if (stm32_go(stm, execute) == STM32_ERR_OK) {
            reset_flag = 0;
            fprintf(diag, "done.\n");
        } else
            fprintf(diag, "failed.\n");
    }

    if (stm && reset_flag) {
        fprintf(diag, "\nResetting device... \n");
        fflush(diag);
        if (init_bl_exit(stm, port, gpio_seq)) {
            ret = 1;
            fprintf(diag, "Reset failed.\n");
        } else
            fprintf(diag, "Reset done.\n");
    } else if (port) {
        /* Always run exit sequence if present */
        if (gpio_seq && strchr(gpio_seq, ':'))
            ret = gpio_bl_exit(port, gpio_seq) || ret;
    }

    if (p_st)
        parser->close(p_st);
    if (stm)
        stm32_close(stm);
    if (port)
        port->close(port);

    fprintf(diag, "\n");
    return ret;
}

void show_help(char* name);
int  parse_options(int argc, char* argv[]) {
    int   c;
    char* pLen;

    init_options();
#if 0
     const char* opts = "a:b:m:r:w:e:vhn:g:jkfcChuos:S:F:i:R";
#else
    const char* opts = "p:b:m:r:w:e:vhn:g:jkfcChuos:S:F:R";
#endif
    optind = 1;  // Because parse_options can be called multiple times
    action = ACT_NONE;
    while (1) {
        if ((c = getopt(argc, argv, opts)) == -1) {
            break;
        }
        switch (c) {
            case 'p':
                port_opts.device = strdup(optarg);
                break;
#if 0
             case 'a':
                port_opts.bus_addr = strtoul(optarg, NULL, 0);
                break;
#endif

            case 'b':
#if 0
                port_opts.baudRate = serial_get_baud(strtoul(optarg, NULL, 0));
                if (port_opts.baudRate == SERIAL_BAUD_INVALID) {
                    serial_baud_t baudrate;
                    fprintf(stderr, "Invalid baud rate, valid options are:\n");
                    for (baudrate = SERIAL_BAUD_1200; baudrate != SERIAL_BAUD_INVALID; ++(int)baudrate)
                        fprintf(stderr, " %d\n", serial_get_baud_int(baudrate));
                    return 1;
                }
#else
                port_opts.baudRate = strtoul(optarg, NULL, 0);
#endif
                break;

            case 'm':
#if 0
                if (strlen(optarg) != 3 || serial_get_bits(optarg) == SERIAL_BITS_INVALID ||
                    serial_get_parity(optarg) == SERIAL_PARITY_INVALID || serial_get_stopbit(optarg) == SERIAL_STOPBIT_INVALID) {
                    fprintf(stderr, "Invalid serial mode\n");
                    return 1;
                }
#else
                if (strlen(optarg) != 3) {
                    fprintf(stderr, "Invalid serial mode\n");
                    return 1;
                }
#endif
                port_opts.serial_mode = optarg;
                break;

            case 'r':
            case 'w':
                if (action != ACT_NONE) {
                    err_multi_action((c == 'r') ? ACT_READ : ACT_WRITE);
                    return 1;
                }
                action   = (c == 'r') ? ACT_READ : ACT_WRITE;
                filename = optarg;
                fprintf(stderr, "Filename %s\n", filename);
                if (filename[0] == '-' && filename[1] == '\0') {
                    use_stdinout = 1;
                    force_binary = 1;
                }
                break;
            case 'e':
                if (readwrite_len || start_addr) {
                    fprintf(stderr, "ERROR: Invalid options, can't specify start page / num pages and start address/length\n");
                    return 1;
                }
                npages = strtoul(optarg, NULL, 0);
                if (npages > STM32_MAX_PAGES || npages < 0) {
                    fprintf(stderr, "ERROR: You need to specify a page count between 0 and 255");
                    return 1;
                }
                if (!npages)
                    no_erase = 1;
                break;
            case 'u':
                if (action != ACT_NONE) {
                    err_multi_action(ACT_WRITE_UNPROTECT);
                    return 1;
                }
                action = ACT_WRITE_UNPROTECT;
                break;

            case 'j':
                if (action != ACT_NONE) {
                    err_multi_action(ACT_READ_PROTECT);
                    return 1;
                }
                action = ACT_READ_PROTECT;
                break;

